# Notebook: Titanic 
## Task 3 
## Author: Cera Drake
## Date: 9/23/2023

## Section 1: Load the CSV file

In [2]:
import pandas as pd

titanic = pd.read_csv('https://vincentarelbundock.github.io/' + 'Rdatasets/csv/carData/TitanicSurvival.csv')

titanic.head() 
titanic.tail()

                       rownames survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

## Section 2: View

In [14]:
pd.set_option("display.precision", 2)
titanic.head()

                              name survived     sex    age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1   Allison, Master. Hudson Trevor      yes    male   0.92   1st
2     Allison, Miss. Helen Loraine       no  female   2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st

## Section 3: Headings

In [6]:
titanic.columns = ['name', 'survived', 'sex', 'age', 'class']
titanic.head()

                              name survived     sex      age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000   1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167   1st
2     Allison, Miss. Helen Loraine       no  female   2.0000   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000   1st

## Section 4: Describe

In [7]:
titanic.describe()

               age
count  1046.000000
mean     29.881135
std      14.413500
min       0.166700
25%      21.000000
50%      28.000000
75%      39.000000
max      80.000000

## Section 5: Survivors

In [8]:
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

## Section 6: Histogram

In [13]:
%matplotlib
histogram = titanic.hist()

Using matplotlib backend: TkAgg